public abstract class StudentBase {
    public static Student[] createDataBase(){
        Student[] database = new Student[10];
       database[0] = new Student("001","Філонова", "Богдана", "Едуардівна", "16.04.2004", "Гадяч, Драгоманова 16",
               "+38(50)673-61-22", "Режисура","4","ВТЗ");
        database[1] = new Student("002","Дорошенко", "Ольга", "Миколаївна", "12.06.2004", "Гадяч, Драгоманова 16",
                "+38(50)321-70-78", "Режисура","4","ВТЗ");
        database[2] = new Student("003","Таран", "Яна", "Андріївна", "21.08.2005", "Гадяч, Драгоманова 16",
                "+38(50)801-56-02", "Режисура","4","ВТЗ");
        database[3] = new Student("004","Стародуб", "Ростислав", "Володимирович", "26.09.2003", "Гадяч, Драгоманова 16",
                "+38(50)944-13-64", "Режисура","4","ВТЗ");
        database[4] = new Student("005","Синьоока", "Дарія", "Олександрівна", "18.05.2002", "Гадяч, Драгоманова 16",
                "+38(50)589-33-71", "Режисура","4","ВТЗ");
        database[5] = new Student("006","Белаш", "Ніна", "Олексіївна", "26.01.2005", "Гадяч, Драгоманова 16",
                "+38(50)497-82-59", "Хорове","3","НПМ");
        database[6] = new Student("007","Микиченко", "Наталія", "Андріївна", "18.03.2004", "Гадяч, Драгоманова 16",
                "+38(50)693-11-28", "Хорове","4","НПМ");
        database[7] = new Student("008","Сук", "Діана", "Олександрівна", "17.11.2003", "Гадяч, Драгоманова 16",
                "+38(50)680-15-65", "Хорове","3","НПМ");
        database[8] = new Student("009","Корзун", "Богдана", "Романівна", "27.06.2005", "Гадяч, Драгоманова 16",
                "+38(50)629-60-29", "Хорове","3","НПМ");
        database[9] = new Student("010","Макаренко", "Аліна", "Даниловна", "29.03.2004", "Гадяч, Драгоманова 16",
                "+38(50)404-84-94", "Хорове","4","НПМ");
        return database;
    }

}
