public abstract class UserBase {
    public static Subscriber[] userBase = new Subscriber[10];

    public static Subscriber[] createUserBase() {
        userBase[0] = new Subscriber("001","Філонова", "Богдана", "Едуардівна", "Гадяч", "+38(50)673-61-22",
                "AC01", "194.01f","1936","0", "40");
        userBase[1] = new Subscriber("002","Дорошенко", "Ольга", "Миколаївна", "Гадяч", "+38(50)321-70-78",
                "AC02", "103.3f","729","0", "25");
        userBase[2] = new Subscriber("003","Таран", "Яна", "Андріївна", "Гадяч", "+38(50)801-56-02",
                "AC03", "-35.93f","113","0", "13");
        userBase[3] = new Subscriber("004","Стародуб", "Ростислав", "Володимирович", "Гадяч", "+38(50)944-13-64",
                "AC04", "92.7f","129","197", "19");
        userBase[4] = new Subscriber("005","Синьоока", "Дарія", "Олександрівна", "Гадяч", "+38(50)589-33-71",
                "AC05", "13.19f","2031","0", "50");
        userBase[5] = new Subscriber("006","Белаш", "Ніна", "Олексіївна", "Гадяч", "+38(50)497-82-59",
                "AC06", "205f","3004","324", "75");
        userBase[6] = new Subscriber("007","Микиченко", "Наталія", "Андріївна", "Гадяч", "+38(50)693-11-28",
                "AC07", "-3.97f","824","0", "15");
        userBase[7] = new Subscriber("008","Сук", "Діана", "Олександрівна", "Гадяч", "+38(50)680-15-65",
                "AC08", "946.9f","4819","0", "70");
        userBase[8] = new Subscriber("009","Корзун", "Богдана", "Романівна", "Гадяч", "+38(50)629-60-29",
                "AC09", "","836","293", "60");
        userBase[9] = new Subscriber("010","Макаренко", "Аліна", "Даниловна", "Гадяч", "+38(50)404-84-94",
                "AC10", "-0.31f","969","0", "50");
        return userBase;
    }
}
